# Юнит-тест для ДЗ "кулинарная книга".

import unittest
from task2 import solve

class Task2TestCase(unittest.TestCase):
    def test_solve(self):
        cook_book = [
            ['Салат',
             [
                 ['картофель', 100, 'гр.'],
                 ['морковь', 50, 'гр.'],
                 ['огурцы', 50, 'гр.'],
                 ['горошек', 30, 'гр.'],
                 ['майонез', 70, 'мл.'],
             ]
             ],
            ['Пицца',
             [
                 ['сыр', 50, 'гр.'],
                 ['томаты', 50, 'гр.'],
                 ['тесто', 100, 'гр.'],
                 ['бекон', 30, 'гр.'],
                 ['колбаса', 30, 'гр.'],
                 ['грибы', 20, 'гр.'],
             ],
             ],
            ['Фруктовый десерт',
             [
                 ['хурма', 60, 'гр.'],
                 ['киви', 60, 'гр.'],
                 ['творог', 60, 'гр.'],
                 ['сахар', 10, 'гр.'],
                 ['мед', 50, 'мл.'],
             ]
             ]
        ]

        my_cook_book = [
            ['Шарлотка',
             [
                 ['мука ', 1, 'ст.'],
                 ['сахар', 1, 'ст.'],
                 ['яйца', 3, 'шт.'],
                 ['яблоки', 4, 'шт.'],
                 ['ванилин', 1, 'щеп.'],
             ]
             ],
            ['Сырники',
             [
                 ['творог', 400, 'гр.'],
                 ['яйца', 2, 'шт.'],
                 ['сахар', 4, 'ст.л.'],
                 ['мука', 3, 'ст.л.'],
                 ['масло растительное', 1, 'ст.л.'],
             ],
             ]
        ]

        person = 3
        answer = ['Шарлотка: мука 3 ст., сахар 3 ст., яйца 9 шт., яблоки 12 шт., ванилин 3 щеп.',
                  'Сырники: творог 1200 гр., яйца 8 шт., сахар 12 ст.л., мука 9 ст.л., масло растительное 3 ст.л.']


        result = solve(cook_book, person)

        for dish_recipe in [['Салат'], ['Пицца'], ['Фруктовый десерт']]:
            self.assertIn(dish_recipe,
                            cook_book,
                            f'{dish_recipe} не присутствует в "кулинарной книге"')



# assert result == ['Салат: картофель 500 гр., морковь 250 гр., огурцы 250 гр., горошек 150 гр., майонез 350 мл.',
#                       'Пицца: сыр 250 гр., томаты 250 гр., тесто 500 гр., бекон 150 гр., колбаса 150 гр., грибы 100 гр.',
#                       'Фруктовый десерт: хурма 300 гр., киви 300 гр., творог 300 гр., сахар 50 гр., мед 250 мл.'],\
